### Ali Abid
- Roll: 380054

In [120]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [121]:
df = sns.load_dataset("tips")

In [122]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [123]:
df.iloc[0:2, :]

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3

In [124]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [125]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [126]:
df.shape

(244, 7)

In [127]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [128]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

In [129]:
df.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [130]:
df.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

# Adding new Columns

In [131]:
df["bill_per_person"] = df["total_bill"] / df["size"]

In [132]:
df.head(3)

   total_bill   tip     sex smoker  day    time  size  bill_per_person
0       16.99  1.01  Female     No  Sun  Dinner     2         8.495000
1       10.34  1.66    Male     No  Sun  Dinner     3         3.446667
2       21.01  3.50    Male     No  Sun  Dinner     3         7.003333

# Weekend

In [133]:
df["is_weekend"] = df["day"].isin(["Sat", "Sun"])

In [134]:
df.tail(2)

,total_bill,tip,sex,smoker,day,time,size,bill_per_person,is_weekend
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,True
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,False